// Task 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// ++++++++++++++++++++
// const number = Number(prompt("Введіть число"));

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// or
// alert(number === 10 ? "Вірно" : "Невірно");

// =====================
// Task 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// +++++++++++++++++++++++
// if (min < 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min < 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min < 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }

// ======================
// Task 3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// ++++++++++++++++++++++++=
// const num = Number(prompt("Введіть число від 1 до 4"));
// let result = "";
// switch (num) {
//   case 1:
//     result = "winter";
//     break;

//   case 2:
//     result = "spring";
//     break;

//   case 3:
//     result = "summer";
//     break;

//   case 4:
//     result = "autumn";
//     break;

//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }

// console.log(result);

// ==========================
// Task 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// ++++++++++++++++++++++++++
// const globalMinutes = prompt("Введіть число");
// const hours = Math.floor(globalMinutes / 60);
// const modifiedHours = String(hours).padStart(2, 0);
// const minutes = globalMinutes % 60;
// const modifiedMinutes = String(minutes).padStart(2, 0);

// const time = `${modifiedHours}:${modifiedMinutes}`;
// console.log(time);

// ===========================
// Task 5
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// +++++++++++++++++++++++++
// const login = prompt("Введіть свій логін");
// console.log(login);

// if (login === "Адмін") {
//   const password = prompt("Введіть свій пароль");

//   if (password === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else if (login === null || login === "") {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

// ========================
// Task 6
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// ++++++++++++++++++++++
// let counter = 0;

// while (counter <= 20) {
//   console.log(counter);
//   counter++;
// }

// =======================
// Task 7
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// ++++++++++++++++++++++++
// function getNumber(min, max) {
//   let sum = 0;

//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }

// console.log(getNumber(23, 50));

// ==========================
// Task 8
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// ++++++++++++++++++++++++++
// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number!";
//   }
//   return Math.min(a, b);
// }

// console.log(min(10, 5));
// console.log(min("10", 5));

// ===========================
// Task 9
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// +++++++++++++++++++++++++++
// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   const check = confirm("Are you adult?");
//   return check;
// }

// or
// function isAdult(age) {
//   return age >= 18 || confirm("Are you adult?");
// }

// console.log(isAdult(22));
// console.log(isAdult(12));

// =============================
// Task 10
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// +++++++++++++++++++++++++++++
// function checkNumber(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log(`${i} fizzbuzz`);
//     } else if (i % 3 === 0) {
//       console.log(`${i} fizz`);
//     } else if (i % 5 === 0) {
//       console.log(`${i} buzz`);
//     }
//   }
// }
// checkNumber(30);

// ===============================
// Додатково, якщо все зробили, можна дати наступні задачі:
// 1. Напишіть функцію, яка перевертатиме рядок у зворотньому порядку

// +++++++++++++++++++++++++++++++
// function reverse(string) {
//   let reverseString = "";
//   // first
//     for (let i = string.length - 1; i >= 0; i--) {
//       reverseString += string[i];
//     }

//   // second
//   //   for (const element of string) {
//   //     reverseString = element + reverseString;
//   //   }

//     return reverseString;

//   // third
// //   return string.split("").reverse().join("");
// }

// console.log(reverse("hello"));

// ======================================
// 2. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

// ++++++++++++++++++++++++++++++++++++++++++++++++++
// let inputValue;
// do {
//   inputValue = prompt("Enter number more then 100");
// } while (inputValue < 100 && inputValue);

// or ++++++++++++++++++++++++++++++++++++++++++++++++++
// let inputValue = prompt("Enter number more then 100");

// while (inputValue < 100 && inputValue) {
//   inputValue = prompt("Enter number more then 100");
// }

// console.log(inputValue || "Error");

// =========================================
// 3. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// const url = "https://my-site.com/about";

// +++++++++++++++++++++++++++++++++++++++++
// function checkUrl(url) {
//   if (url.includes("my-site") && !url.endsWith("/")) {
//     return `${url}/`;
//   }
//   return url;
// }

// console.log(checkUrl(url));
// ===================================
